{
  "backend/main.mo": "Motoko canister storing user inquiries with access control, allowing submission, retrieval, and admin-only listing.",
  "feature_evidence.json": "Feature evidence mapping listing hero/header redesign tasks with associated files, components, and test IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries of various frontend components, styles, hooks, and sections used across the app.",
  "frontend/index.css": "Tailwind base and theme variable definitions for light/dark modes with OKLCH color tokens and global resets.",
  "frontend/index.html": "HTML entry point loading fonts, metadata, favicon, and mounting the React app.",
  "frontend/src/App.tsx": "Root React component composing Header, all content sections, and Footer inside a full‑height layout.",
  "frontend/src/components/sections/AboutSection.tsx": "About section presenting organization description and a grid of four value propositions with icons.",
  "frontend/src/components/sections/ContactSection.tsx": "Contact form with validation, inquiry submission, status notices, and contact info panel.",
  "frontend/src/components/sections/HomeHero.tsx": "Hero section with updated messaging, badges for course modes, background imagery, and smooth-scroll CTAs.",
  "frontend/src/components/sections/InquiryDebugPanel.tsx": "Displays inquiry verification status and details by fetching inquiry data tied to the user's principal.",
  "frontend/src/components/sections/ServicesSection.tsx": "Renders a grid of service cards describing various academic support offerings and levels.",
  "frontend/src/components/sections/StreamsSection.tsx": "Shows academic streams with icons and example fields, plus a CTA for additional stream inquiries.",
  "frontend/src/components/site/Footer.tsx": "Provides footer with branding, navigation shortcuts, contact prompt, and attribution link.",
  "frontend/src/components/site/Header.tsx": "Implements a responsive header with scroll-based styling, navigation links, and mobile menu.",
  "frontend/src/components/site/InlineNotice.tsx": "Displays a styled inline success or error notice with corresponding icon.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor based on authentication state, auto‑refreshing dependent queries.",
  "frontend/src/hooks/useGetInquiry.ts": "Fetches an inquiry for a given principal using the actor, returning null if unavailable.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider for managing Internet Identity login, loading stored identities, and exposing login state helpers.",
  "frontend/src/hooks/useSubmitInquiry.ts": "Defines a React Query mutation that submits an inquiry via the actor and invalidates related queries on success.",
  "frontend/src/index.css": "Defines Tailwind base styles and a custom OKLCH color theme with light/dark mode variables and utility extensions.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading URL parameters, persisting them in sessionStorage, and manipulating hash-based params.",
  "frontend/tailwind.config.js": "Tailwind configuration extending colors, fonts, radii, shadows, and animations based on CSS variables.",
  "project_state.json": "Metadata file describing the project state, features, requirements, and version information."
}